JV4K/STM32_Motor_control/Servo_Controller_f103/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "string.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define RS485_TX_EN_Pin GPIO_PIN_1
#define RS485_TX_EN_GPIO_Port GPIOB
#define NSS_Pin GPIO_PIN_12
#define NSS_GPIO_Port GPIOB
#define NSS_EXTI_IRQn EXTI15_10_IRQn
#define ENA_Pin GPIO_PIN_15
#define ENA_GPIO_Port GPIOA
#define INA2_Pin GPIO_PIN_3
#define INA2_GPIO_Port GPIOB
#define INB2_Pin GPIO_PIN_4
#define INB2_GPIO_Port GPIOB
#define ENA2_Pin GPIO_PIN_5
#define ENA2_GPIO_Port GPIOB
#define INA_Pin GPIO_PIN_6
#define INA_GPIO_Port GPIOB
#define INB_Pin GPIO_PIN_7
#define INB_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define LED_ON HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, 0);
#define LED_OFF HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, 1);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
